### TRAIN TEST SPLIT

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('carprices.csv')
cars = pd.DataFrame(data)
cars

    Mileage  Age(yrs)  Sell Price($)
0     69000         6          18000
1     35000         3          34000
2     57000         5          26100
3     22500         2          40000
4     46000         4          31500
5     59000         5          26750
6     52000         5          32000
7     72000         6          19300
8     91000         8          12000
9     67000         6          22000
10    83000         7          18700
11    79000         7          19500
12    59000         5          26000
13    58780         4          27500
14    82450         7          19400
15    25400         3          35000
16    28000         2          35500
17    69000         5          19700
18    87600         8          12800
19    52000         5          28200

### Preparing X and y

In [7]:
X = cars[['Mileage','Age(yrs)']]
X

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
5     59000         5
6     52000         5
7     72000         6
8     91000         8
9     67000         6
10    83000         7
11    79000         7
12    59000         5
13    58780         4
14    82450         7
15    25400         3
16    28000         2
17    69000         5
18    87600         8
19    52000         5

In [8]:
y = cars['Sell Price($)']
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     26750
6     32000
7     19300
8     12000
9     22000
10    18700
11    19500
12    26000
13    27500
14    19400
15    35000
16    35500
17    19700
18    12800
19    28200
Name: Sell Price($), dtype: int64

### Actual splitting using from sklearn.model_selection import train_test_split

In [10]:
from sklearn.model_selection import train_test_split

####  # Prepared data pass kro

In [18]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2)
X_train

    Mileage  Age(yrs)
19    52000         5
9     67000         6
0     69000         6
5     59000         5
10    83000         7
13    58780         4
16    28000         2
2     57000         5
15    25400         3
11    79000         7
6     52000         5
17    69000         5
12    59000         5
1     35000         3
3     22500         2
7     72000         6

In [12]:
len(X_train)

16

In [13]:
len(X_test)

4

### Using linear regression

In [14]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()

In [15]:
lr.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [16]:
lr.predict(X_test)

array([26083.04027663, 16542.60235899, 17654.56271341, 22747.15921339])

In [19]:
y_test

14    19400
18    12800
4     31500
8     12000
Name: Sell Price($), dtype: int64

In [21]:
lr.score(X_test,y_test)

0.9515171535999533